# 3. Библиотеки анализа данных в Python. Pandas

**Pandas** - это библиотека Python, предоставляющая широкие возможности для анализа данных. С ее помощью очень удобно загружать, обрабатывать и анализировать табличные данные с помощью SQL-подобных запросов. В связке с библиотеками Matplotlib и Seaborn появляется возможность удобного визуального анализа табличных данных.

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

Основными структурами данных в Pandas являются классы `Series` и `DataFrame`. Первый из них представляет собой одномерный индексированный массив данных некоторого фиксированного типа. Второй - это двухмерная структура данных, представляющая собой таблицу, каждый столбец которой содержит данные одного типа. Можно представлять её как словарь объектов типа `Series`. Структура `DataFrame` отлично подходит для представления реальных данных: строки соответствуют признаковым описаниям отдельных объектов, а столбцы соответствуют признакам.

Для начала рассмотрим простые примеры создания таких объектов и возможных операций над ними.

## Series

Создание объекта `Series` из 5 элементов, индексированных буквами:

In [2]:
s = pd.Series(np.random.randn(5), 
              index = ['a', 'b', 'c', 'd', 'e']) 
print(s)

a   -1.166550
b   -0.526974
c    1.833951
d   -1.767390
e    0.950352
dtype: float64

Индексирование возможно в виде `s.Name` или `s['Name']`.

In [3]:
print(s.b == s['b'])

True

`Series` поддерживает пропуски в данных.

In [4]:
s.c = np.nan # Series can contain missing values
print(s)

a   -1.166550
b   -0.526974
c         NaN
d   -1.767390
e    0.950352
dtype: float64

Объекты `Series` похожи на обычный список и могут быть переданы в качестве аргументов большинству функций из NumPy.

In [5]:
print('Second element of s is', s[1], '\n')
# Smart indexing
print(s[:3], '\n')
print('There are', len(s[s > 0]), 'positive elements in s\n')
# Series obects can be the arguments for Numpy functions
print(np.exp(s))

Second element of s is -0.5269742883509915

a   -1.166550
b   -0.526974
c         NaN
dtype: float64

There are 1 positive elements in s

a    0.311439
b    0.590389
c         NaN
d    0.170778
e    2.586620
dtype: float64

## DataFrame

### Создание и изменение

Перейдём к рассмотрению объектов типа `DataFrame`. Такой объект можно создать из массива numpy, указав названия строк и столбцов.

In [12]:
df1 = pd.DataFrame(np.random.randn(5, 3), 
                   index=['o1', 'o2', 'o3', 'o4', 'o5'], 
                   columns=['f1', 'f2', 'f3'])
df1

          f1        f2        f3
o1  0.626926 -1.014563 -0.418903
o2 -1.640704  1.912466 -0.054689
o3 -0.680452  1.414345  0.073898
o4  1.790810 -0.192921  0.446122
o5  1.767089  0.668973  0.300734

Альтернативным способом является создание `DataFrame` из словаря numpy массивов или списков.

In [7]:
df2 = pd.DataFrame({'A': np.random.random(5), 
                    'B': ['a', 'b', 'c', 'd', 'e'], 
                    'C': np.arange(5) > 2})
df2

          A  B      C
0  0.381785  a  False
1  0.936847  b  False
2  0.562367  c  False
3  0.287605  d   True
4  0.615501  e   True

Обращение к элементам (или целым кускам фрейма):

In [8]:
print('The element in position 3, B is', df2.at[3, 'B'], '\n')
print(df2.loc[[1, 4], ['A', 'B']])

The element in position 3, B is d

          A  B
1  0.936847  b
4  0.615501  e

Изменение элементов и добавление новых:

In [9]:
df2.at[2, 'B'] = 'f'
df2

          A  B      C
0  0.381785  a  False
1  0.936847  b  False
2  0.562367  f  False
3  0.287605  d   True
4  0.615501  e   True

In [10]:
df2.loc[5] = [3.1415, 'c', False]
df2

          A  B      C
0  0.381785  a  False
1  0.936847  b  False
2  0.562367  f  False
3  0.287605  d   True
4  0.615501  e   True
5  3.141500  c  False

In [14]:
df1.columns = ['A', 'B', 'C']
df3 = df1.append(df2)
df3

           A         B         C
o1  0.626926 -1.014563 -0.418903
o2 -1.640704  1.912466 -0.054689
o3 -0.680452  1.414345  0.073898
o4  1.790810 -0.192921  0.446122
o5  1.767089  0.668973  0.300734
0   0.381785         a  0.000000
1   0.936847         b  0.000000
2   0.562367         f  0.000000
3   0.287605         d  1.000000
4   0.615501         e  1.000000
5   3.141500         c  0.000000

#### Обработка пропущенных значений

In [15]:
df1.at['o2', 'A'] = np.nan
df1.at['o4', 'C'] = np.nan
df1

           A         B         C
o1  0.626926 -1.014563 -0.418903
o2       NaN  1.912466 -0.054689
o3 -0.680452  1.414345  0.073898
o4  1.790810 -0.192921       NaN
o5  1.767089  0.668973  0.300734

Булева маска для пропущенных значений (True - там, где был пропуск, иначе - False):

In [16]:
pd.isnull(df1)

        A      B      C
o1  False  False  False
o2   True  False  False
o3  False  False  False
o4  False  False   True
o5  False  False  False

Можно удалить все строки, где есть хотя бы один пропуск.

In [17]:
df1.dropna(how='any')

           A         B         C
o1  0.626926 -1.014563 -0.418903
o3 -0.680452  1.414345  0.073898
o5  1.767089  0.668973  0.300734

Пропуски можно заменить каким-то значением.

In [18]:
df1.fillna(0)

           A         B         C
o1  0.626926 -1.014563 -0.418903
o2  0.000000  1.912466 -0.054689
o3 -0.680452  1.414345  0.073898
o4  1.790810 -0.192921  0.000000
o5  1.767089  0.668973  0.300734